Autodesk.Revit.DB.Parameter.GetAssociatedGlobalParameter
Returns a global parameter, if any, currently associated with this parameter.
Remarks:
InvalidElementId is returned in case this parameter is not associated with any global parameter.
InvalidElementId is also returned if called for a parameter that cannot even be associated
with a global parameters (i.e. a non-parametrizable parameter or parameter with a formula).
Returns:
Id of a global parameter or InvalidElemetnId.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This parameter does not exist in the document anymore.
Since:
2016 Subscription Update

Autodesk.Revit.DB.Parameter.CanBeAssociatedWithGlobalParameters
Tests whether this parameter can be associated with any global parameter.
Remarks:
Only properties defined as parametrizable can be associated with global parameters.
That excludes any read-only and formula-driven parameters, as well as those that
have other explicit or implicit restrictions imposed by Revit.
Returns:
True if the given parameter can be associated (is parametrizable); False otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This parameter does not exist in the document anymore.
Since:
2016 Subscription Update

Autodesk.Revit.DB.Parameter.CanBeAssociatedWithGlobalParameter(Autodesk.Revit.DB.ElementId)
Tests whether this parameter can be associated with the given global parameter.
Remarks:
Only properties defined as parametrizable can be associated with global parameters.
That excludes any read-only and formula-driven parameters, as well as those that
have other explicit or implicit restrictions imposed by Revit.
gpId:
Id of a global parameter contained in this parameter's document
Returns:
True if this parameter can be associated with the given global parameter; False otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input gpId is not of a valid global parameter of the given document.
-or-
This parameter does not exist in the document anymore.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016 Subscription Update

Autodesk.Revit.DB.Parameter.DissociateFromGlobalParameter
Dissociates this parameter from a global parameter.
Remarks:
It is assumed this parameter has been previously associated with the global parameter
by using the AssociateWithGlobalParameter(Revit::DB::ElementId^) method.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This parameter does not exist in the document anymore.
-or-
This parameter is either not parameterizable or does not match the type of the global parameter.
Since:
2016 Subscription Update

Autodesk.Revit.DB.Parameter.AssociateWithGlobalParameter(Autodesk.Revit.DB.ElementId)
Associates this parameter with a global parameter in the same document.
Remarks:
The parameter must be parameterizable, meaning it cannot be read-only,
driven by a formula, or have any other restrictions imposed by Revit.
The parameter's value type must match the type of the global parameter.
Once associated property can be later dissociated by calling the
Autodesk.Revit.DB.Parameter.DissociateFromGlobalParameter method
gpId:
Id of a global parameter contained in this parameter's document
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input gpId is not of a valid global parameter of the given document.
-or-
This parameter does not exist in the document anymore.
-or-
This parameter is either not parameterizable or does not match the type of the global parameter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016 Subscription Update

Autodesk.Revit.DB.Parameter.Id
The id of the parameter.
Since: 2011

Autodesk.Revit.DB.Parameter.GUID
The Guid for a shared parameter.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when the parameter is not a shared parameter.
Since: 2011

Autodesk.Revit.DB.Parameter.IsShared
Identifies if the parameter is a shared parameter.
Since: 2011

Autodesk.Revit.DB.Parameter.Element
The element to which this parameter belongs.

Autodesk.Revit.DB.Parameter.Set(Autodesk.Revit.DB.ElementId)
Sets the parameter to a new element id.
value: The new element id to which the parameter is to be set.
Returns: The Set method will return True if the parameter was successfully set to the new value, otherwise false.
Remarks: You should only use this method if the StorageType property reports the type of the
parameter as an ElementId.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: The parameter is read-only.

Autodesk.Revit.DB.Parameter.Set(System.Double)
Sets the parameter to a new real number value.
value: The new double value to which the parameter is to be set.
Returns: The Set method will return True if the parameter was successfully set to the new value, otherwise false.
Remarks: You should only use this method if the StorageType property reports the type of the
parameter as a Double.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: The parameter is read-only.
Throws Autodesk.Revit.Exceptions.ArgumentException: Value must be a finite number.

Autodesk.Revit.DB.Parameter.Set(System.Int32)
Sets the parameter to a new integer value.
value: The new integer value to which the parameter is to be set.
Returns: The Set method will return True if the parameter was successfully set to the new value, otherwise false.
Remarks: You should only use this method if the StorageType property reports the type of the
parameter as an integer.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: The parameter is read-only.

Autodesk.Revit.DB.Parameter.Set(System.String)
Sets the parameter to a new value.
Sets the parameter to a new string of text.
value: The new text value to which the parameter is to be set.
Returns: The Set method will return True if the parameter was successfully set to the new value, otherwise false.
Remarks: You should only use this method if the StorageType property reports the type of the
parameter as a String.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: The parameter is read-only.

Autodesk.Revit.DB.Parameter.AsElementId
Provides access to the Autodesk::Revit::DB::ElementId^ stored within the parameter.
Returns: The Autodesk::Revit::DB::ElementId^ contained in the parameter.
Remarks: The AsAutodesk::Revit::DB::ElementId^ method should only be used if the StorageType property returns that the
internal contents of the parameter is an ElementId.

Autodesk.Revit.DB.Parameter.AsDouble
Provides access to the double precision number within the parameter.
Returns: The double value contained in the parameter.
Remarks: The AsDouble method should only be used if the StorageType property returns that the
internal contents of the parameter is a double.

Autodesk.Revit.DB.Parameter.AsInteger
Provides access to the integer number within the parameter.
Returns: The integer value contained in the parameter.
Remarks: The AsInteger method should only be used if the StorageType property returns that the
internal contents of the parameter is an integer.

Autodesk.Revit.DB.Parameter.AsString
Provides access to the string contents of the parameter.
Returns: The string contained in the parameter.
Remarks: The AsString method should only be used if the StorageType property returns that the
internal contents of the parameter is a string.

Autodesk.Revit.DB.Parameter.DisplayUnitType
Get the display unit type of the parameter object.
Returns: The display unit type of the parameter.
Remarks: The property only applies to parameters of value types.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if this parameter is not of value type.

Autodesk.Revit.DB.Parameter.SetValueString(System.String)
Set the parameter value according to the input string.
valueString: The string that represents the parameter value.
Returns: Indicates whether the parameter value is successfully set.
Remarks: The method only applies to parameters of value types.

Autodesk.Revit.DB.Parameter.AsValueString(Autodesk.Revit.DB.FormatOptions)
Get the parameter value as a string with units.
Returns: The string that represents the parameter value.
Since: 2014
formatOptions: Options for formatting the string.

Autodesk.Revit.DB.Parameter.AsValueString
Get the parameter value as a string with units.
Returns: The string that represents the parameter value.

Autodesk.Revit.DB.Parameter.HasValue
Identifies if the parameter has an assigned value.
Since:
2012

Autodesk.Revit.DB.Parameter.UserModifiable
Indicates whether the interactive user can modify the value of this parameter.
Since:  2015
Remarks:
Note that for shared parameters IsReadOnly can return false for shared parameters whose UserModifiable property is
also false, because the value of those parameters can be modified by the API. If a parameter is governed by a formula,
IsReadOnly would return true, even if the flag for UserModifiable was set to true when the shared parameter was created.

Autodesk.Revit.DB.Parameter.IsReadOnly
Get the readonly property of the parameter.
Remarks: This function can be used to check if the parameter is read-only.

Autodesk.Revit.DB.Parameter.StorageType
Describes the type that is used internally within the parameter to store its value.
Remarks: The property will return one of the following possibilities: String, Integer, Double
or ElementId. Based on the value of this property the correct access and set methods should be used
to retrieve and set the parameter's data value.

Autodesk.Revit.DB.Parameter.Definition
Returns the Definition object that describes the data type, name and other details of the
parameter.
Remarks: This will always be an Autodesk.Revit.DB.InternalDefinition object.
If you want the Guid for a shared parameter, use Autodesk.Revit.DB.Parameter.GUID.

Autodesk.Revit.DB.Parameter
The parameter object contains the value data assigned to that parameter.
Remarks: The piece of data contained within the parameter can be either a Double, Integer,
String or ElementId. The parameter object can be retrieved from any Element object using
either a built in id, definition object or shared parameter guid. All Elements within
Autodesk Revit contain Parameters. These are options that can be accessed in a generic
fashion. Revit contains many built in parameter types but users and now developers, via the
API, can add their own parameters in the form of shared parameters. The developer should
become familiar with the Revit user interface for added and managing parameters and shared
parameters before using this API. The user interface components can be found in the following
locations: Element Properties dialog, Shared Parameters dialog (available from the File menu),
Project Parameters dialog (available from the Settings menu), Family Types dialog (available
from the Settings menu when editing a family). There are several relationships between the
objects that make up the APIs exposure of parameters. The parameter object contains the data
value. Parameter objects can be retrieved from Elements if you know its built-in id,
its definition or its shared parameter guid. Each parameter has a definition. New parameters
can be added to Elements by adding a ParameterBinding object to the Document object.